ДСУтест/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДСУтест/src/AccumulationRegisters/ОстаткиПоСчетам/ОстаткиПоСчетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоСчетам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/InformationRegisters/КурсыВалют/Forms/ФормаНабораЗаписей/Module.bsl
&НаКлиенте
Процедура ОбновитьНадписьКурсыАктуальны() Экспорт
	
	НадписьКА = Элементы.НадписьКурсыВалют;
	 
	Если КурсыВалютАктуальны(ТекущаяДата()) Тогда
		НадписьКА.Заголовок = "Курсы валют актуальны";
		НадписьКА.ЦветТекста = WebЦвета.Зеленый;
	Иначе
	    НадписьКА.Заголовок = "Курсы валют не актуальны! Исправить!";
		НадписьКА.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;	 
	
КонецПроцедуры	


&НаКлиенте
Процедура НадписьКурсыВалютНажатие(Элемент)
	
	ФормаВводаКурсов = ПолучитьФорму("ОбщаяФорма.ФормаВводаКурсовВалют");
	ФормаВводаКурсов.ДатаКурсов = ТекущаяДата();

	Если Не ФормаВводаКурсов.Открыта() Тогда
		ФормаВводаКурсов.ОткрытьМодально();
	КонецЕсли;
	
	ОбновитьНадписьКурсыАктуальны();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыПриИзменении(Элемент)
	ОбновитьНадписьКурсыАктуальны();	
КонецПроцедуры

&НаКлиенте
Процедура КурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьНадписьКурсыАктуальны();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьНадписьКурсыАктуальны();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуАктуальностиКурсов(ДатаКурсов, флгТолькоНеактуальныеКурсы = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Период,
	|	КурсыВалютСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&ДатаКурсов, Валюта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Остатки.Валюта
	|				ИЗ
	|					РегистрНакопления.ОстаткиПоСчетам.Остатки(&ДатаКурсов, Валюта.Используется И Валюта <> &ВалютаУчета) КАК Остатки)
	|			) КАК КурсыВалютСрезПоследних"
	+ ?(флгТолькоНеактуальныеКурсы, " Где КурсыВалютСрезПоследних.Период < НачалоПериода(&ДатаКурсов, День)", "");
	Запрос.УстановитьПараметр("ДатаКурсов", КонецДня(ДатаКурсов));
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ОсновнаяВалютаУчета.Получить());
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	                                             

&НаСервереБезКонтекста
Функция КурсыВалютАктуальны(ДатаКурсов) Экспорт 
	
	ТаблицаКурсов = ПолучитьТаблицуАктуальностиКурсов(ДатаКурсов, Истина);
	Возврат ТаблицаКурсов.Количество() = 0;
	
КонецФункции
